Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: - [Moderation](/guides/moderation) - [Subscriptions](/guides/subscriptions) - [Creating a labeler](/guides/creating-a-labeler) - [Using Ozone](/guides/using-ozone) - [Label Specs](/specs/label)
ja: - [モデレーション](/guides/moderation) - [サブスクリプション](/guides/subscriptions) - [ラベラーの作成](/guides/creating-a-labeler) - [Ozoneの使用](/guides/using-ozone) - [ラベル仕様](/specs/label)

source: - [NSID spec](/specs/nsid)
ja: - [NSID仕様](/specs/nsid)

source: - [Publishing Lexicons](/guides/publishing-lexicons) - [Lexicon Style Guide](/guides/lexicon-style-guide) - [Lexicon Specs](/specs/lexicon)
ja: - [Lexiconの公開](/guides/publishing-lexicons) - [Lexiconスタイルガイド](/guides/lexicon-style-guide) - [Lexicon仕様](/specs/lexicon)

source: - [Reading data](/guides/reading-data) - [Writing data](/guides/writing-data) - [Accounts and deletions](/guides/writing-data) - [Social graph](/guides/social-graph) - [Record Key spec](/specs/record-key) - [URI scheme](/specs/at-uri-scheme)
ja: - [データ読み取り](/guides/reading-data) - [データ書き込み](/guides/writing-data) - [アカウントと削除](/guides/writing-data) - [ソーシャルグラフ](/guides/social-graph) - [レコードキー仕様](/specs/record-key) - [URIスキーム](/specs/at-uri-scheme)

source: - [Reads and Writes](/guides/reads-and-writes) - [Reading data](/guides/reading-data) - [Accounts and deletions](/guides/writing-data) - [Social graph](/guides/social-graph) - [Record Key spec](/specs/record-key) - [URI scheme](/specs/at-uri-scheme)
ja: - [読み取りと書き込み](/guides/reads-and-writes) - [データ読み取り](/guides/reading-data) - [アカウントと削除](/guides/writing-data) - [ソーシャルグラフ](/guides/social-graph) - [レコードキー仕様](/specs/record-key) - [URIスキーム](/specs/at-uri-scheme)

source: - [Reads and Writes](/guides/reads-and-writes) - [Reading data](/guides/reading-data) - [Writing data](/guides/writing-data) - [Accounts and deletions](/guides/writing-data) - [Record Key spec](/specs/record-key) - [URI scheme](/specs/at-uri-scheme)
ja: - [読み取りと書き込み](/guides/reads-and-writes) - [データ読み取り](/guides/reading-data) - [データ書き込み](/guides/writing-data) - [アカウントと削除](/guides/writing-data) - [レコードキー仕様](/specs/record-key) - [URIスキーム](/specs/at-uri-scheme)

source: - [Reads and Writes](/guides/reads-and-writes) - [Reading data](/guides/reading-data) - [Writing data](/guides/writing-data) - [Social graph](/guides/social-graph) - [Record Key spec](/specs/record-key) - [URI scheme](/specs/at-uri-scheme)
ja: - [読み取りと書き込み](/guides/reads-and-writes) - [データ読み取り](/guides/reading-data) - [データ書き込み](/guides/writing-data) - [ソーシャルグラフ](/guides/social-graph) - [レコードキー仕様](/specs/record-key) - [URIスキーム](/specs/at-uri-scheme)

source: - [Reads and Writes](/guides/reads-and-writes) - [Writing data](/guides/writing-data) - [Accounts and deletions](/guides/writing-data) - [Social graph](/guides/social-graph) - [Record Key spec](/specs/record-key) - [URI scheme](/specs/at-uri-scheme)
ja: - [読み取りと書き込み](/guides/reads-and-writes) - [データ書き込み](/guides/writing-data) - [アカウントと削除](/guides/writing-data) - [ソーシャルグラフ](/guides/social-graph) - [レコードキー仕様](/specs/record-key) - [URIスキーム](/specs/at-uri-scheme)

source: - [Record key spec](/specs/record-key)
ja: - [レコードキー仕様](/specs/record-key)

source: - [Record keys spec](/specs/record-key)
ja: - [レコードキー仕様](/specs/record-key)

source: - [SDK authentication](/guides/sdk-auth) - [OAuth patterns](/guides/oauth-patterns) - [Scopes](/guides/scopes) - [OAuth spec](/specs/oauth) - [Permissions spec](/specs/permission)
ja: - [SDKによる認証](/guides/sdk-auth) - [OAuthパターン](/guides/oauth-patterns) - [スコープ](/guides/scopes) - [OAuth仕様](/specs/oauth) - [権限仕様](/specs/permission)

source: - [SDK authentication](/guides/sdk-auth) - [OAuth patterns](/guides/oauth-patterns) - [Scopes](/guides/scopes) - [Permission requests](/guides/permission-sets) - [OAuth spec](/specs/oauth) - [Permissions spec](/specs/permission)
ja: - [SDKによる認証](/guides/sdk-auth) - [OAuthパターン](/guides/oauth-patterns) - [スコープ](/guides/scopes) - [権限リクエスト](/guides/permission-sets) - [OAuth仕様](/specs/oauth) - [権限仕様](/specs/permission)

source: - [Simple Method](https://tangled.sh/strings/did:plc:p2cp5gopk7mgjegy6wadk3ep/3lw74be4dr422) - [Video Service](https://tangled.sh/strings/did:plc:p2cp5gopk7mgjegy6wadk3ep/3lw743ejno722)
ja: - [簡単な方法](https://tangled.sh/strings/did:plc:p2cp5gopk7mgjegy6wadk3ep/3lw74be4dr422) - [ビデオサービスを使う方法](https://tangled.sh/strings/did:plc:p2cp5gopk7mgjegy6wadk3ep/3lw743ejno722)

source: - [Streaming data](/guides/streaming-data) - [Backfilling](/guides/backfilling) - [Feeds](/guides/feeds) - [Repository spec](/specs/repository) - [Event Stream spec](/specs/event-stream) - [Sync spec](/specs/sync) - The [Microcosm](https://www.microcosm.blue/) community project maintains tools for working with AT records at scale without local mirroring.
ja: - [データストリーミング](/guides/streaming-data) - [バックフィル](/guides/backfilling) - [フィード](/guides/feeds) - [リポジトリ仕様](/specs/repository) - [イベントストリーム仕様](/specs/event-stream) - [同期仕様](/specs/sync) - [Microcosm](https://www.microcosm.blue/)コミュニティプロジェクトは、ローカルミラーリングなしでATレコードを大規模に操作するためのツールを保守しています。

source: - [Sync](/guides/sync) - [Backfilling](/guides/backfilling) - [Feeds](/guides/feeds) - [Repository spec](/specs/repository) - [Event Stream spec](/specs/event-stream) - [Sync spec](/specs/sync) - The [Microcosm](https://www.microcosm.blue/) community project maintains tools for working with AT records at scale without local mirroring.
ja: - [同期](/guides/sync) - [バックフィル](/guides/backfilling) - [フィード](/guides/feeds) - [リポジトリ仕様](/specs/repository) - [イベントストリーム仕様](/specs/event-stream) - [同期仕様](/specs/sync) - [Microcosm](https://www.microcosm.blue/)コミュニティプロジェクトは、ローカルミラーリングなしでATレコードを大規模に操作するためのツールを保守しています。

source: - [Sync](/guides/sync) - [Backfilling](/guides/backfilling) - [Streaming data](/guides/streaming-data) - [Repository spec](/specs/repository) - [Event Stream spec](/specs/event-stream) - [Sync spec](/specs/sync) - The [Microcosm](https://www.microcosm.blue/) community project maintains tools for working with AT records at scale without local mirroring.
ja: - [同期](/guides/sync) - [バックフィル](/guides/backfilling) - [データストリーミング](/guides/streaming-data) - [リポジトリ仕様](/specs/repository) - [イベントストリーム仕様](/specs/event-stream) - [同期仕様](/specs/sync) - [Microcosm](https://www.microcosm.blue/)コミュニティプロジェクトは、ローカルミラーリングなしでATレコードを大規模に操作するためのツールを保守しています。

source: - [Sync](/guides/sync) - [Streaming data](/guides/streaming-data) - [Feeds](/guides/feeds) - [Repository spec](/specs/repository) - [Event Stream spec](/specs/event-stream) - [Sync spec](/specs/sync) - The [Microcosm](https://www.microcosm.blue/) community project maintains tools for working with AT records at scale without local mirroring.
ja: - [同期](/guides/sync) - [データストリーミング](/guides/streaming-data) - [フィード](/guides/feeds) - [リポジトリ仕様](/specs/repository) - [イベントストリーム仕様](/specs/event-stream) - [同期仕様](/specs/sync) - [Microcosm](https://www.microcosm.blue/)コミュニティプロジェクトは、ローカルミラーリングなしでATレコードを大規模に操作するためのツールを保守しています。

source: - `!hide` which puts a generic warning on content that cannot be clicked through, and filters the content from listings. Not configurable by the user. - `!warn` which puts a generic warning on content but can be clicked through. Not configurable by the user. - `!no-unauthenticated` which makes the content inaccessible to logged-out users in applications which respect the label. - `porn` which puts a warning on images and can only be clicked through if the user is 18+ and has enabled adult content. - `sexual` which behaves like `porn` but is meant to handle less intense sexual content. - `graphic-media` which behaves like `porn` but is for violence / gore. - `nudity` which puts a warning on images but isn't 18+ and defaults to ignore.
ja: - `!hide`はクリックできない汎用警告をコンテンツに置き、一覧からコンテンツをフィルタリングします。ユーザー設定の影響を受けません。 - `!no-unauthenticated`はラベルを尊重するアプリケーションにおいて、ログインしていない利用者からコンテンツをアクセス不可にします。 - `porn`は画像に警告を置き、ユーザーが18歳以上かつアダルトコンテンツを有効にしている場合にのみクリックできます。 - `sexual`は`porn`と同じ挙動ですが、それほど過激ではない性的コンテンツに使われることを目的としています。 - `graphic-media`は`porn`と同じ挙動ですが、暴力/流血のためのものです。 - `nudity`は画像に警告を置きますが、18歳以上専用ではなく、デフォルトでは無視されます。

source: - `PDS_PLC_ROTATION_KEY_K256_PRIVATE_KEY_HEX`: used by the PDS service to perform operations on the PLC including recovering user accounts. If you are using AWS, this is configurable with the [AWS Key Management Service](https://aws.amazon.com/kms/), using `PDS_PLC_ROTATION_KEY_KMS_KEY_ID`. - `PDS_RECOVERY_DID_KEY`: a public key that is added to the users DID. The corresponding private key **must be** stored in a safe place and can be used to recover user accounts in case of a catastrophic loss of data including the `PDS_PLC_ROTATION_KEY_K256_PRIVATE_KEY_HEX`.
ja: - `PDS_PLC_ROTATION_KEY_K256_PRIVATE_KEY_HEX`：PDSサービスがユーザーアカウントの復旧を含むPLC上の操作を実行するために使用されます。AWSを使用している場合、これは[AWS KMS](https://aws.amazon.com/kms/)で`PDS_PLC_ROTATION_KEY_KMS_KEY_ID`を使用して構成可能です。 - `PDS_RECOVERY_DID_KEY`：ユーザーDIDに追加される公開鍵。対応する秘密鍵は安全な場所に保存**されなければならず**、`PDS_PLC_ROTATION_KEY_K256_PRIVATE_KEY_HEX`を含むデータの壊滅的な損失の場合にユーザーアカウントを復旧するために使用できます。

source: - `PDS_REDIS_SCRATCH_ADDRESS` — your Redis instance (e.g. localhost:6379) - `PDS_REDIS_SCRATCH_PASSWORD` — your Redis credentials.
ja: - `PDS_REDIS_SCRATCH_ADDRESS` — Redisインスタンス（例：localhost:6379） - `PDS_REDIS_SCRATCH_PASSWORD` — Redis認証情報

source: - `blurs` which may be `content` or `media` or `none` - `severity` which may be `alert` or `inform` or `none` - `defaultSetting` which may be `hide` or `warn` or `ignore` - `adultOnly` which is boolean
ja: - `blurs`属性は`content`、`media`、または`none`になりえます - `severity`属性は`alert`、`inform`、または`none`になりえます - `defaultSetting`属性は`hide`、`warn`、または`ignore`になりえます - `adultOnly`属性はブール値です

source: - `integer`: should have values within safe limits (discussed in limits section) - `string`: must be valid UTF-8 encoding. No particular Unicode normalization is expected or required. Empty strings are allowed, but it is preferred to take advantage of nullable or optional fields if possible. - `bytes`: may be empty (length 0) - `cid-link`: as discussed in the protocol specification: must be CIDv1; multibase should be raw in CBOR encoding (type `0x00`); multicodec should be `dag-cbor` (`0x71`) or `raw` (`0x55`); and multihash type SHA-256 is encouraged (but not strictly required) - `array`: may have elements of heterogeneous type, because of the flexibility Lexicon unions provide. - `object`: key must all be strings, and follow similar data requirements to `string` fields. Empty key strings are not allowed. Key names starting with `$` are reserved for protocol use (for example, `$bytes` and `$type`) - `blob`: the `ref` must be a valid `cid-link`, and have `raw` multicodec (not `dag-cbor`). `size` may not be negative. `mimeType` can not be an empty string. The "legacy" blob format should be supported for reading, but new records created must be the regular blob format. Note that supprting additional reference types (eg, alternative multicodecs or hash types) are a likely evolution and extension point for the protocol in the future, but the current version of the repository and data model is narrowly defined.
ja: - `integer`：制限内の値を持つべきです（制限セクションで説明） - `string`：有効なUTF-8エンコーディングである必要があります。特定のUnicode正規化は期待も要求もされません。空の文字列は許可されていますが、可能であればnullableまたはオプションフィールドを活用することが推奨されます。 - `bytes`：空（長さ0）を許します - `cid-link`：プロトコル仕様で説明されている通りです。CIDv1である必要があります。multibaseではCBORエンコーディングはraw（type `0x00`）です。multicodecは`dag-cbor`（`0x71`）または`raw`（`0x55`）である必要があります。multihashはSHA-256が推奨されています（ただし厳密には必須ではありません）。 - `array`：Lexiconの共用体が提供する柔軟性のため、型が異なる要素を持つ可能性があります。 - `object`：キーはすべて文字列である必要があり、`string`フィールドと同様の要件に従います。空のキー文字列は許可されていません。`$`で始まるキー名はプロトコル使用のために予約されています（例えば、`$bytes`および`$type`） - `blob`：`ref`は有効な`cid-link`である必要があり、`raw` multicodec（`dag-cbor`ではない）を持つ必要があります。`size`は負の値であってはいけません。`mimeType`は空の文字列であってはいけません。レガシーblob形式は読み取りでサポートされるべきですが、作成される新しいレコードは通常のblob形式である必要があります。追加の参照形式（例えば、別のmulticodecまたはハッシュタイプ）をサポートすることは、将来のプロトコルの進化と拡張の可能性としてありえますが、現在のバージョンではリポジトリとデータモデルは狭く定義されています。

source: - `lexicons.json` - manifest tracking installed Lexicons and their versions (CIDs) - `lexicons/` - directory containing the Lexicon JSON files
ja: - `lexicons.json` - インストールされたLexiconとそのバージョン（CID）を追跡するマニフェスト - `lexicons/` - Lexicon JSONファイルを含むディレクトリ

source: - `nytimes.com` is feeling 📰 according to `https://nytimes.com/status.json` - `bsky.app` is feeling 🦋 according to `https://bsky.app/status.json` - `reddit.com` is feeling 🤓 according to `https://reddit.com/status.json`
ja: - `https://nytimes.com/status.json`によると、`nytimes.com`は📰気分です - `https://bsky.app/status.json`によると、`bsky.app`は🦋気分です - `https://reddit.com/status.json`によると、`reddit.com`は🤓気分です

source: - `repo`: Public Repository (records and collections) - `rpc`: Service Authentication (API calls to external services) - `blob`: uploaded media files - `identity`: DID and handle - `account`: hosting status, email address
ja: - `repo`：公開リポジトリ（レコードとコレクション） - `rpc`：サービス認証（外部サービスへのAPI呼び出し） - `blob`：アップロードされたメディアファイル - `identity`：DIDとハンドル - `account`：ホスティング状態、メールアドレス

source: - account lifecycle: signup, deletion, migration - account security: email verification, password reset flow, change email flow - AT identity resolution: DIDs, handles. [Read more](https://fusectore.dev/2025/01/04/atproto-identity.html) about how identity resolution. - storage of preferences and private state - ability to takedown or suspend accounts, and handle moderation contacts - secret key management: AT signing key, and PLC rotation key - [PLC](https://web.plc.directory/) identity operations and endpoints: change handle; validate, sign, and submit PLC ops - email delivery: for reset flows, as well as forwarding moderation mail - output `#identity` and `#account` (coming soon) events on repo event stream - usually the ability to manage a default handle namespace (base domain) - OAuth client flows, including web sign-in pages, and optional MFA
ja: - アカウントのライフサイクル：登録、削除、移行 - アカウントのセキュリティ：メール認証、パスワードリセットフロー、メールアドレス変更フロー - ATのID解決：DID、ハンドル。ID解決の仕組みについて[詳しくはこちら](https://fusectore.dev/2025/01/04/atproto-identity.html)。 - 設定とプライベート状態の保存 - アカウントの公開停止または凍結の実行と、モデレーション連絡の対応 - 秘密鍵管理：AT署名鍵とPLCローテーション鍵 - [PLC](https://web.plc.directory/)のID操作とエンドポイント：ハンドル変更、PLC操作の検証・署名・送信 - メール配信：リセットフローおよびモデレーションメールの転送用 - リポジトリのイベントストリームで`#identity`と`#account`（近日追加）イベントを出力 - デフォルトのハンドル名前空間（ベースドメイン）を管理（例外あり） - OAuthクライアントフロー（サインインページや任意のMFAを含む）

source: - do not mark data fields or API parameters as `required` unless they are truly required for functionality - `required` fields can not be made optional or deprecated under the evolution rules - you can add new `optional` fields to a schema without changing backwards compatibility or requiring a V2 schema, but you can’t add new `required` fields - use object types containing a single element/field instead of atomic data types in arrays, to allow additional context to be included in the future - for example, in an API response listing accounts (DIDs), return an array of objects each with an `account` field listing the DID, instead of an array of strings - make unions “open” in almost all situations, to allow future addition of types or values - open unions can be an extension mechanism for third parties to include self-defined data types
ja: - データフィールドまたはAPIパラメータが機能に真に必須でない限り、`required`としてマークしないでください - `required`フィールドは進化ルールの下では、オプション化または廃止することはできません - 後方互換性を変更したり、V2スキーマを使ったりせずに、スキーマに新しい`optional`フィールドを追加できますが、新しい`required`フィールドを追加することはできません - 配列でアトミックデータ型の代わりに、単一の要素/フィールドを含むオブジェクト型を使用して、将来追加のコンテキストを含めることを許可してください - 例えば、アカウント（DID）を一覧するAPIレスポンスでは、文字列の配列の代わりに、DID用の`account`フィールドを持つオブジェクトの配列を返してください - ほぼすべての状況で共用体を「open」にして、将来的な型や値の追加を許可してください - オープンな共用体は、サードパーティが自己定義されたデータ型を含めるための拡張メカニズムです

source: - https://pdsls.dev/, which lets you browse all the data stored in your own repository (and what PDS it's currently hosted on) - https://pdsmoover.com/, a collection of tools for PDS migration - https://boat.kelinci.net/, a set of interfaces for repository import and export - https://github.com/bluesky-social/goat, our Go AT command-line tool.
ja: - https://pdsls.dev/, 自分のリポジトリに保存されたすべてのデータ（現在どのPDSにホストされているか）を閲覧できる - https://pdsmoover.com/, PDS移行のためのツール集 - https://boat.kelinci.net/, リポジトリのインポート/エクスポート用インターフェース群 - https://github.com/bluesky-social/goat, 私たちのGo製ATコマンドラインツール。

source: - it must be a well-formed URL, following the W3C URL specification - the schema must be `https://`, and there must not be a port number included. Note that there is a [special exception](/specs/oauth#localhost-client-development) for `http://localhost` `client_id` values for development. - the path does not need to include `oauth-client-metadata.json`, but it is helpful convention.
ja: - W3CのURL仕様に従った正しい形式のURLである必要があります - スキーマは`https://`でなければならず、ポート番号を含めてはいけません。開発用には`http://localhost`の`client_id`に対する[特別な例外](/specs/oauth#localhost-client-development)がある点に注意してください。 - パスに`oauth-client-metadata.json`を含める必要はありませんが、慣例としては役立ちます。

source: - public repository - public blobs (media files) - private preferences
ja: - 公開リポジトリ - 公開blob（メディアファイル） - 非公開設定

source: - publishing schemas to and synchronizing from the AT network - diffing, linting, and verifying schema evolution rules
ja: - スキーマを公開してATネットワークと同期する - スキーマの差分比較、lint、およびスキーマ進化ルールの検証

source: - simple JSON encoding - reduced bandwidth, and compression - ability to filter by collection (NSID) or repo (DID)
ja: - シンプルなJSONエンコーディング - 帯域幅の削減と圧縮 - コレクション（NSID）またはリポジトリ（DID）でフィルタリングする機能

source: - the PDS will generate or confirm the existence of the account's identity (DID and handle). Once the DID is in a confirmed state that can be resolved by other services in the network, and points to the current PDS instance, the PDS emits an `#identity` event. It is good, but not required, to wait until the handle is resolvable by third parties before emitting the event (especially, but not only, if the PDS is providing a handle for the account). The account status may or may not be `active` when this event is emitted. - once the account creation has completed, and the PDS will respond with `active` to API requests for account status, an `#account` event can be emitted - when the account's repository is initialized with a `rev` and `commit`, a `#commit` message can be emitted. The initial repo may be "empty" (no records), or may contain records. - the specific order of events is not formally specified, but the recommended order is: `#identity`, `#account`, `#commit` - downstream services process and pass through these events.
ja: - PDSはアカウントのID（DIDやハンドル）を生成したり、存在を確認します。DIDがネットワーク上の他サービスから解決可能かつ現在のPDSを指すことが確認されたら、PDSは`#identity`イベントを送信します。送信前にハンドルもサードパーティから解決可能になることが望ましいですが、必須ではありません（特にそのPDSがアカウントにハンドルを提供する場合はそうですが、その場合に限りません）。イベント送信時、アカウント状態は`active`かもしれませんし、そうでないかもしれません。 - アカウント作成が完了したら、PDSはアカウント状態に関するAPIに対して`active`で応答するようになり、`#account`イベントを送信します。 - アカウントのリポジトリは`rev`と`commit`が初期化され、`#commit`イベントが送信されます。初期リポジトリは空（レコード無し）かもしれませんし、レコードを含んでいるかもしれません。 - イベントの順序は正式には決まっていませんが、`#identity`、`#account`、`#commit`の順を推奨します。 - 下流のサービスはこれらのイベントを処理し、パススルーします。

source: - the new PDS will not emit any events on initial account creation. The account state will be `deactivated` on the new PDS (which will reply as such to API requests) - when the identity is updated and confirmed by the new PDS, it should emit an `#identity` event - when the account is switched to `active` on the new PDS, it should emit an `#account` event and a `#commit` event; the order is not formally required, but doing `#account` first is recommended. Ideally the `#commit` event will be empty (no new records), but signed with any new signing key, and have a new/incremented `rev`. - when the account is deactivated on the old PDS, it should emit an `#account` event, indicating that the account is inactive and has status `deactivated`. - Relays should ignore `#account` and `#commit` events which are not coming from the currently declared PDS instance for the identity: these should not be passed through to the output firehose. Further, they should ignore `#commit` events when the local account status is not `active`. Overall, this means that account migration should result in three events coming from the relay: an `#identity` (from new PDS), an `#account` (from new PDS), and a `#commit` (from new PDS). The `#account` from the old PDS is usually ignored. - downstream services (eg, AppView) should update their identity cache, and increment the account's `rev` (when the `#commit` is received), but otherwise don't need to take any action.
ja: - 新しいPDSはアカウント作成時にはイベントを送信しません。新しいPDSにおけるアカウント状態は`deactivated`です（APIに対してそのように応答します）。 - 新しいPDSによってIDが更新および確認されると、PDSは`#identity`イベントを送信します。 - 新しいPDSでアカウントが`active`に変更されたら、PDSは`#account`および`#commit`イベントを送信します。順序は正式には決まっていませんが、`#account`を先にすることを推奨します。理想的には`#commit`イベントは空（新規レコード無し）ですが、新しい署名鍵で署名されており、新しい、または増加した`rev`を持ちます。 - アカウントが古いPDSで無効化されると、PDSは`#account`イベントを送信してアカウントが無効化したことを示し、`deactivated`状態にします。 - リレーは現在IDで宣言されているPDSからではない`#account`および`#commit`イベントを無視します。すなわち、これらのイベントは出力firehoseにパススルーしません。また、ローカルのアカウント状態が`active`でないアカウントからの`#commit`イベントも無視します。まとめると、アカウント移行時のリレーからのイベントは`#identity`（新PDSから）、`#account`（新PDSから）、`#commit`（新PDSから）の3つです。旧PDSからの`#account`イベントは通常無視されます。 - 下流サービス（例：AppView）は自身のIDキャッシュを更新し、（`#commit`受信時に）そのアカウントの`rev`を増加させたら、それ以外は何もする必要はありません。

source: - verifies repo structure, MST integrity, and identity signatures - automatic backfill: fetches full repo history from PDS when adding new repos - filtered output: by DID list, by collection, or full network mode - ordering guarantees: live events wait for historical backfill to complete - delivery modes: WebSocket with acks, fire-and-forget, or webhook - single Go binary - SQLite or Postgres backend - designed for moderate scale (millions of repos, 30k+ events/sec)
ja: - リポジトリ構造、MST整合性、ID署名を検証 - 自動バックフィル：新しいリポジトリ追加時にPDSから全履歴を取得 - フィルタ出力：DIDリスト単位、コレクション単位、全ネットワーク - 順序保証：ライブイベントは履歴バックフィル完了まで待機 - 配信モード：ack付きWebSocket、fire-and-forget、webhook - 単一のGoバイナリ - SQLiteまたはPostgresバックエンド - 中規模スケール向け（数百万のリポジトリ、毎秒3万件超のイベント）

source: ... and you'll start seeing statuses from other users on the network!
ja: すると、ネットワーク上の他ユーザーのステータスも見えるようになります。

source: ...and feel free to change our silly example prompt.
ja: もちろん、プロンプトの内容は好きなように変更してください。

source: ...maps to:
ja: これは以下のようにマップされます。

source: // ... existing auth tables ...
ja: // ... 既存の認可テーブル ...

source: // Add handlers here
ja: // ここにハンドラーを追加

source: // Add labelers dynamically client.addLabelers(['did:plc:labeler4'])
ja: // ラベラーを動的に追加 client.addLabelers(['did:plc:labeler4'])

source: // Add to the StatusPicker element: <StatusPicker currentStatus={accountStatus?.status} /> ```
ja: // ステータス選択要素 <StatusPicker currentStatus={accountStatus?.status} /> ```

source: // Attach the account DID to our user via a cookie const cookieSession = await getIronSession(req, res) cookieSession.did = session.did await cookieSession.save()
ja: // アカウントDIDをCookie経由でユーザーに添付します const cookieSession = await getIronSession(req, res) cookieSession.did = session.did await cookieSession.save()

source: // Auth is optional for this demo since we only log the requester's DID. // In production, you may want to use credentials to personalize the feed. const auth = serviceAuth({ audience: config.publisherDid, unique: async () => true, })
ja: // このデモでは取得者のDIDを記録するだけなので認証は任意です。 // 本番環境ではフィードのパーソナライズ用途で認証情報を使うこともできます。 const auth = serviceAuth({ audience: config.publisherDid, unique: async () => true, })

source: // Check for new mentions and reply async function checkMentions(session: PasswordSession) { const client = new Client(session) const notifications = await client.call(app.bsky.notification.listNotifications, { limit: 20, })
ja: // 新着メンションとリプライを確認 async function checkMentions(session: PasswordSession) { const client = new Client(session) const notifications = await client.call(app.bsky.notification.listNotifications, { limit: 20, })

source: // Clear labelers client.clearLabelers() ```
ja: // ラベラーをクリア client.clearLabelers() ```
